{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "CWE-94",
    "1": "CWE-538",
    "2": "CWE-89",
    "3": "CWE-77",
    "4": "CWE-79",
    "5": "CWE-352",
    "6": "CWE-601",
    "7": "CLEAN"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "CLEAN": 7,
    "CWE-352": 5,
    "CWE-538": 1,
    "CWE-601": 6,
    "CWE-77": 3,
    "CWE-79": 4,
    "CWE-89": 2,
    "CWE-94": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.56.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
